<template>
  <div class="app-container timeComparison-container">
    <panel-group @handleSetLineChartData="handleSetLineChartData" />
    
    <el-row :gutter="32" style="background:#fff;padding:16px 16px 0;margin-bottom:32px;">
      <el-col :xs="24" :sm="24" :lg="14">
        <line-chart :chart-data="lineChartData" />
      </el-col>
      <el-col :xs="24" :sm="24" :lg="10">
        <div class="chart-wrapper">
          <pie-chart :chart-data="lineChartData" />
        </div>
      </el-col>
    </el-row>

    <panel-group2 @handleSetLineChartData2="handleSetLineChartData2" />

    <el-row :gutter="32" style="background:#fff;padding:16px 16px 0;margin-bottom:32px;">
      <el-col :xs="24" :sm="24" :lg="14">
        <line-chart :chart-data="lineChartData2" />
      </el-col>
      <el-col :xs="24" :sm="24" :lg="10">
        <div class="chart-wrapper">
          <pie-chart :chart-data="lineChartData2" />
        </div>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import PanelGroup from './components/city/PanelGroup'
import PanelGroup2 from './components/city/PanelGroup2'
import LineChart from './components/city/LineChart'
import PieChart from './components/city/PieChart'

const lineChartData2 = {
  newVisitis: {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '11,110102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '11,110106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '11,110107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '11,110108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '11,110109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '11,110112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '11,110113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '11,110114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '11,110115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '11,110117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '11,110118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '11,110119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '12,120101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '12,120102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '12,120103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '12,120104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '12,120105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '12,120106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '12,120110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '12,120111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '12,120112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '12,120113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '12,120114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '12,120115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '12,120116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '12,120117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '12,120118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '12,120119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '13,1301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },
  '13,1302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 131, 104, 105, 90, 100, 130, 161, 134, 105, 160],
    NineteenData: [130, 90, 100, 138, 142, 130, 130, 130, 91, 154, 162, 160]
  },
  '13,1303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '13,1304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '13,1305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '13,1306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },
  '13,1307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 131, 104, 105, 90, 100, 130, 161, 134, 105, 160],
    NineteenData: [130, 90, 100, 138, 142, 130, 130, 130, 91, 154, 162, 160]
  },
  '13,1308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '13,1309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '13,1310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '13,1311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },


  '14,1401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 141, 104, 105, 90, 100, 140, 161, 144, 105, 160],
    NineteenData: [140, 90, 100, 148, 142, 140, 140, 140, 91, 154, 162, 160]
  },
  '14,1402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [140, 140, 141, 142, 145, 150, 160, 140, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '14,1403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '14,1404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '14,1405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '14,1406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },
  '14,1407': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 131, 104, 105, 90, 100, 130, 161, 134, 105, 160],
    NineteenData: [130, 90, 100, 138, 142, 130, 130, 130, 91, 154, 162, 160]
  },
  '14,1408': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '14,1409': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '14,1410': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '14,1411': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },


  '15,1501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '15,1502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '15,1503': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '15,1504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '15,1505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '15,1506': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '15,1507': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '15,1508': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '15,1509': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '15,1522': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '15,1525': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '15,1529': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '21,2101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '21,2102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '21,2103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '21,2104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '21,2105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '21,2106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '21,2107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '21,2108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '21,2109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '21,2110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '21,2111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '21,2112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '21,2113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '21,2114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '22,2201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '22,2202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '22,2203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '22,2204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '22,2205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '22,2206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '22,2207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '22,2208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '22,2224': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },


  '23,2301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '23,2302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '23,2303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '23,2304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '23,2305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '23,2306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '23,2307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '23,2308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '23,2309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '23,2310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '23,2311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '23,2312': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '23,2327': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '31,310101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '31,310104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '31,310105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '31,310106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '31,310107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '31,310109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '31,310110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '31,310112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '31,310113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '31,310114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '31,310115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '31,310116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '31,310117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '31,310118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '31,310120': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '31,310151': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '32,3201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '32,3202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '32,3203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '32,3204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '32,3205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '32,3206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '32,3207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '32,3208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '32,3209': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '32,3210': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '32,3211': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '32,3212': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '32,3213': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '33,3301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '33,3302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '33,3303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '33,3304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '33,3305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '33,3306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '33,3307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '33,3308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '33,3309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '33,3310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '33,3311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '34,3401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '34,3402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '34,3403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '34,3404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '34,3405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '34,3406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '34,3407': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '34,3408': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '34,3410': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '34,3411': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '34,3412': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '34,3413': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '34,3415': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '34,3416': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '34,3417': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '34,3418': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '35,3501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 135, 105, 160]
  },
  '35,3502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 135, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '35,3503': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 135, 105, 160]
  },
  '35,3504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 135, 105, 160]
  },
  '35,3505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 161, 135, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '35,3506': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 135, 105, 160]
  },
  '35,3507': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 135, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '35,3508': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 135, 105, 160]
  },
  '35,3509': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 135, 105, 160]
  },


  '36,3601': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 136, 105, 160, 165, 120, 161, 136, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '36,3603': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 136, 105, 160]
  },
  '36,3604': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 136, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '36,3605': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 136, 105, 160]
  },
  '36,3606': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '36,3607': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 136, 105, 160, 165, 120, 161, 136, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '36,3608': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 136, 105, 160]
  },
  '36,3609': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 136, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '36,3610': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 136, 105, 160]
  },
  '36,3611': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 136, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 136, 105, 160]
  },

  
  '37,3701': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '37,3702': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 137, 105, 160]
  },
  '37,3703': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 137, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '37,3704': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 137, 105, 160]
  },
  '37,3705': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 137, 105, 160]
  },
  '37,3706': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '37,3707': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 137, 105, 160]
  },
  '37,3708': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 137, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '37,3709': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '37,3710': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 137, 105, 160]
  },
  '37,3711': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '37,3713': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 137, 105, 160]
  },
  '37,3714': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 137, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '37,3715': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 137, 105, 160]
  },
  '37,3716': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 137, 105, 160]
  },
  '37,3717': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '41,4101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,4103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 141, 105, 160]
  },
  '41,4104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 141, 105, 160]
  },
  '41,4105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 161, 141, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '41,4106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,4108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 141, 105, 160]
  },
  '41,4109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 141, 105, 160]
  },
  '41,4110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '41,4111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,4113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 141, 105, 160]
  },
  '41,4114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 141, 105, 160]
  },
  '41,4115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 161, 141, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '41,4116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,419001': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '42,4201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '42,4202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '42,4203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '42,4205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '42,4206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '42,4207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 142, 105, 160]
  },
  '42,4208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '42,4209': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '42,4210': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '42,4211': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '42,4212': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 142, 105, 160]
  },
  '42,4213': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '42,4228': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '42,429004': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '42,429005': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '42,429006': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 142, 105, 160]
  },
  '42,429021': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '43,4301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '43,4302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '43,4303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '43,4304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 143, 105, 160]
  },
  '43,4305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 161, 143, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '43,4306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 143, 105, 160]
  },
  '43,4307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 143, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '43,4308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 143, 105, 160]
  },
  '43,4309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 143, 105, 160]
  },
  '43,4310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 161, 143, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '43,4311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 143, 105, 160]
  },
  '43,4312': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 143, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '43,4313': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 143, 105, 160]
  },
  '43,4331': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 143, 105, 160]
  },


  '44,4401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 144, 105, 160]
  },
  '44,4405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4407': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4408': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4409': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 143, 105, 160]
  },
  '44,4412': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4413': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4414': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4415': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4416': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 144, 105, 160]
  },
  '44,4417': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4418': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4419': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4420': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4451': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 144, 105, 160]
  },
  '44,4452': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4453': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '45,4501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '45,4502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 145, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '45,4503': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 145, 105, 160]
  },
  '45,4504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 145, 105, 160]
  },
  '45,4505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 161, 145, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '45,4506': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 145, 105, 160]
  },
  '45,4507': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 145, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '45,4508': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 145, 105, 160]
  },
  '45,4509': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 145, 105, 160]
  },
  '45,4510': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 161, 145, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '45,4511': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 145, 105, 160]
  },
  '45,4512': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 145, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '45,4513': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 145, 105, 160]
  },
  '45,4514': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 145, 105, 160]
  },


  '46,4601': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 161, 146, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,4602': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,4603': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,4604': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 146, 105, 160]
  },
  '46,469001': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 146, 105, 160]
  },
  '46,469002': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 161, 146, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,469005': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,469006': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,469007': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 146, 105, 160]
  },
  '46,469021': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 146, 105, 160]
  },
  '46,469022': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 161, 146, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,469023': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,469024': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,469025': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 146, 105, 160]
  },
  '46,469026': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 146, 105, 160]
  },
  '46,469027': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,469028': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,469029': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,469030': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '50,500101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500120': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500151': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500152': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500153': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500154': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500155': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500156': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500229': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500230': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500231': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500233': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500235': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500236': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500237': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500238': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500240': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500241': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500242': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500243': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },


  '51,5101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '51,5104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '51,5105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 151, 105, 160]
  },
  '51,5109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 151, 105, 160]
  },
  '51,5110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 151, 105, 160]
  },
  '51,5115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 151, 105, 160]
  },
  '51,5116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 151, 105, 160]
  },
  '51,5120': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 151, 105, 160]
  },
  '51,5132': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5133': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5134': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '52,5201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '52,5202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '52,5203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 152, 105, 160]
  },
  '52,5204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 152, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '52,5205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '52,5206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 152, 105, 160]
  },
  '52,5223': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '52,5226': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 152, 105, 160]
  },
  '52,5227': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 152, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '53,5301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '53,5303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 152, 105, 160]
  },
  '53,5304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '53,5305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 152, 105, 160]
  },
  '53,5306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 152, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '53,5307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '53,5308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '53,5309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 153, 105, 160]
  },
  '53,5323': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 153, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '53,5325': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 153, 105, 160]
  },
  '53,5326': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 153, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 153, 105, 160]
  },
  '53,5328': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 153, 105, 160, 165, 120, 161, 153, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '53,5329': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 153, 105, 160]
  },
  '53,5331': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 153, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '53,5333': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 153, 105, 160]
  },
  '53,5334': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '54,5401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 154, 105, 160, 165, 120, 161, 154, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '54,5402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 154, 105, 160]
  },
  '54,5403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 154, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '54,5404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 154, 105, 160]
  },
  '54,5405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 154, 105, 160, 165, 120, 161, 154, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '54,5406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 154, 105, 160]
  },
  '54,5425': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 154, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '61,6101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 161, 162, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 130, 120, 161, 161, 105, 160]
  },
  '61,6102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 91, 161, 162, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 145, 120, 161, 161, 105, 160]
  },
  '61,6103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 161, 161, 105, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 145, 120, 91, 161, 162, 160]
  },
  '61,6104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 161, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 161, 105, 160]
  },
  '61,6105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 161, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 161, 162, 160]
  },
  '61,6106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 161, 162, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 130, 120, 161, 161, 105, 160]
  },
  '61,6107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 154, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 154, 105, 160]
  },
  '61,6108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 161, 161, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '61,6109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 161, 105, 160]
  },
  '61,6110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 161, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '62,6201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 161, 105, 160]
  },
  '62,6202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 161, 161, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '62,6203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '62,6204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 162, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '62,6205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 162, 105, 160]
  },
  '62,6206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 162, 105, 160]
  },
  '62,6207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 161, 162, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '62,6208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 162, 105, 160]
  },
  '62,6209': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 162, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '62,6210': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 162, 105, 160]
  },
  '62,6211': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 162, 105, 160]
  },
  '62,6212': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 161, 162, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '62,6229': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 162, 105, 160]
  },
  '62,6230': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '63,6301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 163, 105, 160]
  },
  '63,6302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 163, 105, 160, 165, 120, 161, 163, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '63,6322': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 163, 105, 160]
  },
  '63,6323': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 163, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '63,6325': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 163, 105, 160]
  },
  '63,6326': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 163, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 163, 105, 160]
  },
  '63,6327': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 163, 105, 160, 165, 120, 161, 163, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '63,6328': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 163, 105, 160]
  },


  '64,6401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 163, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '64,6402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 163, 105, 160]
  },
  '64,6403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 164, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 164, 105, 160]
  },
  '64,6404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 164, 105, 160, 165, 120, 161, 164, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '64,6405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 164, 105, 160]
  },


  '65,6501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,6502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,6504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 161, 165, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,6505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,6523': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,6527': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,6528': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 165, 105, 160]
  },
  '65,6529': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,6530': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,6531': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,6532': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,6540': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 165, 105, 160]
  },
  '65,6542': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 161, 165, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,6543': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,659001': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,659002': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,659003': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 161, 165, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,659004': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,659006': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  }
}

const lineChartData = {
  newVisitis: {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '11,110102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '11,110106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '11,110107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '11,110108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '11,110109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '11,110112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '11,110113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '11,110114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '11,110115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '11,110116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '11,110117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '11,110118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '11,110119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '12,120101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '12,120102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '12,120103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '12,120104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '12,120105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '12,120106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '12,120110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '12,120111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '12,120112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '12,120113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '12,120114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '12,120115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '12,120116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '12,120117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '12,120118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '12,120119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '13,1301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },
  '13,1302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 131, 104, 105, 90, 100, 130, 161, 134, 105, 160],
    NineteenData: [130, 90, 100, 138, 142, 130, 130, 130, 91, 154, 162, 160]
  },
  '13,1303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '13,1304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '13,1305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '13,1306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },
  '13,1307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 131, 104, 105, 90, 100, 130, 161, 134, 105, 160],
    NineteenData: [130, 90, 100, 138, 142, 130, 130, 130, 91, 154, 162, 160]
  },
  '13,1308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '13,1309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '13,1310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '13,1311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },


  '14,1401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 141, 104, 105, 90, 100, 140, 161, 144, 105, 160],
    NineteenData: [140, 90, 100, 148, 142, 140, 140, 140, 91, 154, 162, 160]
  },
  '14,1402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [140, 140, 141, 142, 145, 150, 160, 140, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '14,1403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '14,1404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '14,1405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '14,1406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 130, 144, 160, 130, 140, 130, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 130, 161, 134, 105, 160]
  },
  '14,1407': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 131, 104, 105, 90, 100, 130, 161, 134, 105, 160],
    NineteenData: [130, 90, 100, 138, 142, 130, 130, 130, 91, 154, 162, 160]
  },
  '14,1408': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 130, 130, 161, 134, 105, 160]
  },
  '14,1409': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 91, 154, 162, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 161, 134, 105, 160]
  },
  '14,1410': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 130, 161, 134, 105, 160, 165, 130, 161, 134, 105, 160],
    NineteenData: [130, 82, 91, 154, 162, 140, 145, 130, 91, 154, 162, 160]
  },
  '14,1411': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },


  '15,1501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '15,1502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '15,1503': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '15,1504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '15,1505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '15,1506': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '15,1507': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '15,1508': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '15,1509': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '15,1522': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '15,1525': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '15,1529': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '21,2101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '21,2102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '21,2103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '21,2104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '21,2105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '21,2106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '21,2107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '21,2108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '21,2109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '21,2110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '21,2111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '21,2112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '21,2113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '21,2114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '22,2201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '22,2202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '22,2203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '22,2204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '22,2205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '22,2206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '22,2207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '22,2208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '22,2224': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },


  '23,2301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '23,2302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '23,2303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '23,2304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '23,2305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '23,2306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '23,2307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '23,2308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '23,2309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '23,2310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '23,2311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '23,2312': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '23,2327': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '31,310101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '31,310104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '31,310105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '31,310106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '31,310107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '31,310109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '31,310110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '31,310112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '31,310113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '31,310114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '31,310115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '31,310116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '31,310117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '31,310118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '31,310120': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '31,310151': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '32,3201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '32,3202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '32,3203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '32,3204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '32,3205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '32,3206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '32,3207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '32,3208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '32,3209': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '32,3210': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '32,3211': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '32,3212': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '32,3213': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '33,3301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '33,3302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '33,3303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '33,3304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '33,3305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '33,3306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '33,3307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '33,3308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '33,3309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '33,3310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '33,3311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '34,3401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '34,3402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '34,3403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '34,3404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '34,3405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '34,3406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '34,3407': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '34,3408': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '34,3410': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '34,3411': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '34,3412': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '34,3413': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '34,3415': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '34,3416': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '34,3417': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '34,3418': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '35,3501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 135, 105, 160]
  },
  '35,3502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 135, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '35,3503': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 135, 105, 160]
  },
  '35,3504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 135, 105, 160]
  },
  '35,3505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 161, 135, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '35,3506': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 135, 105, 160]
  },
  '35,3507': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 135, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '35,3508': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 135, 105, 160]
  },
  '35,3509': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 135, 105, 160]
  },


  '36,3601': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 136, 105, 160, 165, 120, 161, 136, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '36,3603': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 136, 105, 160]
  },
  '36,3604': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 136, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '36,3605': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 136, 105, 160]
  },
  '36,3606': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 135, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '36,3607': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 136, 105, 160, 165, 120, 161, 136, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '36,3608': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 136, 105, 160]
  },
  '36,3609': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 136, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '36,3610': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 136, 105, 160]
  },
  '36,3611': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 136, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 136, 105, 160]
  },

  
  '37,3701': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '37,3702': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 137, 105, 160]
  },
  '37,3703': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 137, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '37,3704': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 137, 105, 160]
  },
  '37,3705': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 137, 105, 160]
  },
  '37,3706': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '37,3707': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 137, 105, 160]
  },
  '37,3708': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 137, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '37,3709': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },
  '37,3710': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 137, 105, 160]
  },
  '37,3711': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '37,3713': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 137, 105, 160]
  },
  '37,3714': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 137, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '37,3715': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 137, 105, 160]
  },
  '37,3716': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 137, 105, 160]
  },
  '37,3717': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '41,4101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,4103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 141, 105, 160]
  },
  '41,4104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 141, 105, 160]
  },
  '41,4105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 161, 141, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '41,4106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,4108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 141, 105, 160]
  },
  '41,4109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 141, 105, 160]
  },
  '41,4110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 137, 105, 160, 165, 120, 161, 137, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '41,4111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,4113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 141, 105, 160]
  },
  '41,4114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 141, 105, 160]
  },
  '41,4115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 141, 105, 160, 165, 120, 161, 141, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '41,4116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 141, 105, 160]
  },
  '41,4117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 141, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '41,419001': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '42,4201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },
  '42,4202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '42,4203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '42,4205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '42,4206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '42,4207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 142, 105, 160]
  },
  '42,4208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '42,4209': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '42,4210': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '42,4211': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '42,4212': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 142, 105, 160]
  },
  '42,4213': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '42,4228': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '42,429004': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '42,429005': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '42,429006': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 142, 105, 160]
  },
  '42,429021': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 142, 105, 160, 165, 120, 161, 142, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '43,4301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 142, 105, 160]
  },
  '43,4302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 142, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '43,4303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 142, 105, 160]
  },
  '43,4304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 143, 105, 160]
  },
  '43,4305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 161, 143, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '43,4306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 143, 105, 160]
  },
  '43,4307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 143, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '43,4308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 143, 105, 160]
  },
  '43,4309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 143, 105, 160]
  },
  '43,4310': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 161, 143, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '43,4311': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 143, 105, 160]
  },
  '43,4312': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 143, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '43,4313': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 143, 105, 160]
  },
  '43,4331': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 143, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 143, 105, 160]
  },


  '44,4401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 144, 105, 160]
  },
  '44,4405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4407': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4408': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4409': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 143, 105, 160]
  },
  '44,4412': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4413': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4414': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4415': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4416': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 144, 105, 160]
  },
  '44,4417': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4418': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '44,4419': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 144, 105, 160]
  },
  '44,4420': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 144, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '44,4451': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 144, 105, 160]
  },
  '44,4452': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 144, 105, 160]
  },
  '44,4453': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 144, 105, 160, 165, 120, 161, 144, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },


  '45,4501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '45,4502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 145, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '45,4503': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 145, 105, 160]
  },
  '45,4504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 145, 105, 160]
  },
  '45,4505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 161, 145, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '45,4506': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 145, 105, 160]
  },
  '45,4507': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 145, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '45,4508': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 145, 105, 160]
  },
  '45,4509': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 145, 105, 160]
  },
  '45,4510': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 161, 145, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '45,4511': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 145, 105, 160]
  },
  '45,4512': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 145, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '45,4513': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 145, 105, 160]
  },
  '45,4514': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 145, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 145, 105, 160]
  },


  '46,4601': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 161, 146, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,4602': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,4603': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,4604': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 146, 105, 160]
  },
  '46,469001': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 146, 105, 160]
  },
  '46,469002': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 161, 146, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,469005': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,469006': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,469007': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 146, 105, 160]
  },
  '46,469021': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 146, 105, 160]
  },
  '46,469022': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 161, 146, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,469023': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,469024': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,469025': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 146, 105, 160]
  },
  '46,469026': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 146, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 146, 105, 160]
  },
  '46,469027': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '46,469028': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 146, 105, 160]
  },
  '46,469029': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 146, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '46,469030': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 134, 105, 160]
  },


  '50,500101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500112': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500120': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500151': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500152': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500153': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500154': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500155': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500156': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500229': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500230': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500231': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500233': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500235': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500236': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500237': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },
  '50,500238': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '50,500240': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '50,500241': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '50,500242': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 161, 150, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '50,500243': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 150, 105, 160]
  },


  '51,5101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 150, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 150, 105, 160]
  },
  '51,5104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 150, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 150, 105, 160]
  },
  '51,5105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 151, 105, 160]
  },
  '51,5109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 151, 105, 160]
  },
  '51,5110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5111': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5113': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5114': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 151, 105, 160]
  },
  '51,5115': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 151, 105, 160]
  },
  '51,5116': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5117': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5118': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '51,5119': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 151, 105, 160]
  },
  '51,5120': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 151, 105, 160]
  },
  '51,5132': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 151, 105, 160, 165, 120, 161, 151, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '51,5133': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 151, 105, 160]
  },
  '51,5134': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 151, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '52,5201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '52,5202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '52,5203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 152, 105, 160]
  },
  '52,5204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 152, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '52,5205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '52,5206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 152, 105, 160]
  },
  '52,5223': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '52,5226': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 152, 105, 160]
  },
  '52,5227': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 152, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '53,5301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '53,5303': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 152, 105, 160]
  },
  '53,5304': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '53,5305': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 152, 105, 160]
  },
  '53,5306': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 152, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '53,5307': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 152, 105, 160]
  },
  '53,5308': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 152, 105, 160, 165, 120, 161, 152, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '53,5309': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 153, 105, 160]
  },
  '53,5323': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 153, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '53,5325': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 153, 105, 160]
  },
  '53,5326': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 153, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 153, 105, 160]
  },
  '53,5328': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 153, 105, 160, 165, 120, 161, 153, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '53,5329': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 153, 105, 160]
  },
  '53,5331': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 153, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '53,5333': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 153, 105, 160]
  },
  '53,5334': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 134, 105, 160]
  },


  '54,5401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 154, 105, 160, 165, 120, 161, 154, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '54,5402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 154, 105, 160]
  },
  '54,5403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 154, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '54,5404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 154, 105, 160]
  },
  '54,5405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 154, 105, 160, 165, 120, 161, 154, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '54,5406': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 154, 105, 160]
  },
  '54,5425': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 154, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '61,6101': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 161, 162, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 130, 120, 161, 161, 105, 160]
  },
  '61,6102': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 91, 161, 162, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 145, 120, 161, 161, 105, 160]
  },
  '61,6103': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 161, 161, 105, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 145, 120, 91, 161, 162, 160]
  },
  '61,6104': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 161, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 161, 105, 160]
  },
  '61,6105': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 161, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 161, 162, 160]
  },
  '61,6106': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 161, 162, 160],
    NineteenData: [120, 82, 91, 161, 162, 140, 130, 120, 161, 161, 105, 160]
  },
  '61,6107': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 154, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 154, 105, 160]
  },
  '61,6108': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 161, 161, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '61,6109': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 161, 105, 160]
  },
  '61,6110': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 161, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '62,6201': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 161, 105, 160]
  },
  '62,6202': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 161, 105, 160, 165, 120, 161, 161, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '62,6203': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134, 105, 160]
  },
  '62,6204': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 162, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '62,6205': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 162, 105, 160]
  },
  '62,6206': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 162, 105, 160]
  },
  '62,6207': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 161, 162, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '62,6208': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 162, 105, 160]
  },
  '62,6209': {
    pieData: [{ value: 187, name: '2019上半年' }, { value: 257, name: '2019下半年' }, { value: 338, name: '2020上半年' }, { value: 278, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 162, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '62,6210': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 162, 105, 160]
  },
  '62,6211': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 162, 105, 160]
  },
  '62,6212': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 162, 105, 160, 165, 120, 161, 162, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '62,6229': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 162, 105, 160]
  },
  '62,6230': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 134, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },


  '63,6301': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 163, 105, 160]
  },
  '63,6302': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 163, 105, 160, 165, 120, 161, 163, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '63,6322': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 163, 105, 160]
  },
  '63,6323': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 163, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '63,6325': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 163, 105, 160]
  },
  '63,6326': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 163, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 163, 105, 160]
  },
  '63,6327': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 163, 105, 160, 165, 120, 161, 163, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '63,6328': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 163, 105, 160]
  },


  '64,6401': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 163, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '64,6402': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 163, 105, 160]
  },
  '64,6403': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 164, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 164, 105, 160]
  },
  '64,6404': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 164, 105, 160, 165, 120, 161, 164, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '64,6405': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 164, 105, 160]
  },


  '65,6501': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,6502': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,6504': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 161, 165, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,6505': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 187, name: '2019下半年' }, { value: 257, name: '2020上半年' }, { value: 338, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,6523': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,6527': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,6528': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 165, 105, 160]
  },
  '65,6529': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 134, 105, 160, 165, 120, 161, 134, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,6530': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,6531': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,6532': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,6540': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 161, 165, 105, 160]
  },
  '65,6542': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 161, 165, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,6543': {
    pieData: [{ value: 278, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 187, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,659001': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  },
  '65,659002': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [130, 140, 141, 142, 145, 150, 160, 120, 91, 154, 162, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 130, 120, 161, 165, 105, 160]
  },
  '65,659003': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [100, 120, 161, 165, 105, 160, 165, 120, 161, 165, 105, 160],
    NineteenData: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154, 162, 160]
  },
  '65,659004': {
    pieData: [{ value: 320, name: '2019上半年' }, { value: 240, name: '2019下半年' }, { value: 187, name: '2020上半年' }, { value: 257, name: '2020下半年' }],
    TwentyData: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154, 162, 160],
    NineteenData: [180, 160, 151, 106, 145, 150, 130, 120, 161, 165, 105, 160]
  },
  '65,659006': {
    pieData: [{ value: 338, name: '2019上半年' }, { value: 278, name: '2019下半年' }, { value: 149, name: '2020上半年' }, { value: 100, name: '2020下半年' }],
    TwentyData: [80, 100, 121, 104, 105, 90, 100, 120, 161, 165, 105, 160],
    NineteenData: [120, 90, 100, 138, 142, 130, 130, 120, 91, 154, 162, 160]
  }
}
export default {
  name: 'timeComparison',
  components: { 
    PanelGroup,
    PanelGroup2,
    LineChart,
    PieChart
  },
  data() {
    return {
      lineChartData: lineChartData.newVisitis,
      lineChartData2: lineChartData2.newVisitis
    }
  },
  methods: {
    handleSetLineChartData(type) {
      this.lineChartData = lineChartData[type]
    },
    handleSetLineChartData2(type) {
      this.lineChartData2 = lineChartData2[type]
    }
  }
}
</script>

<style lang="scss" scoped>
.timeComparison-container {
  padding: 32px;
  background-color: rgb(240, 242, 245);
  position: relative;
  .chart-wrapper {
    background: #fff;
    padding: 16px 16px 0;
    margin-bottom: 32px;
  }
}
@media (max-width:1024px) {
  .chart-wrapper {
    padding: 8px;
  }
}
</style>
