<template>
  <div class="app-container timeComparison-container">
    <panel-group @handleSetLineChartData="handleSetLineChartData" />
    
    <el-row :gutter="32" style="background:#fff;padding:16px 16px 0;margin-bottom:32px;">
      <el-col :xs="24" :sm="24" :lg="16">
        <line-chart :chart-data="lineChartData" />
      </el-col>
      <el-col :xs="24" :sm="24" :lg="8">
        <div class="chart-wrapper">
          <pie-chart :chart-data="lineChartData" />
        </div>
      </el-col>
    </el-row>

    <panel-group2 @handleSetLineChartData2="handleSetLineChartData2" />

    <el-row :gutter="32" style="background:#fff;padding:16px 16px 0;margin-bottom:32px;">
      <el-col :xs="24" :sm="24" :lg="16">
        <line-chart :chart-data="lineChartData2" />
      </el-col>
      <el-col :xs="24" :sm="24" :lg="8">
        <div class="chart-wrapper">
          <pie-chart :chart-data="lineChartData2" />
        </div>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import PanelGroup from './components/time/PanelGroup'
import PanelGroup2 from './components/time/PanelGroup2'
import LineChart from './components/time/LineChart'
import PieChart from './components/time/PieChart'

const lineChartData2 = {
  newVisitis: {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 120, 161, 134, 130, 160, 165, 120, 161, 134],
    chengdu: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154],
    shanghai: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154],
    guangzhou: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134],
    hangzhou: [86, 184, 64, 165, 175, 133, 81, 60, 137, 115],
    shenzhen: [148, 137, 74, 113, 21, 18, 92, 55, 83, 90],

  },
  'Sixteen,January': {
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164],
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
  },
  'Sixteen,february': {
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88],
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
  },
  'Sixteen,March': {
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118],
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
  },
  'Sixteen,April': {
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112],
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
  },
  'Sixteen,May': {
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164],
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
  },
  'Sixteen,June': {
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112],
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
  },
  'Sixteen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Sixteen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Sixteen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Sixteen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Sixteen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Sixteen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Seventeen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Seventeen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Seventeen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Seventeen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Seventeen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Seventeen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Seventeen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Seventeen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Seventeen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Seventeen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Seventeen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Seventeen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Eighteen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Eighteen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Eighteen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Eighteen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Eighteen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Eighteen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Eighteen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Eighteen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Eighteen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Eighteen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Eighteen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Eighteen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Nineteen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Nineteen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Nineteen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Nineteen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Nineteen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Nineteen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Nineteen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Nineteen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Nineteen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Nineteen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Nineteen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Nineteen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Twenty,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Twenty,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Twenty,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Twenty,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Twenty,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Twenty,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Twenty,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Twenty,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Twenty,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Twenty,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Twenty,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Twenty,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
}

const lineChartData = {
  newVisitis: {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 120, 161, 134, 130, 160, 165, 120, 161, 134],
    chengdu: [120, 82, 91, 154, 162, 140, 145, 120, 91, 154],
    shanghai: [200, 192, 120, 144, 160, 130, 140, 120, 91, 154],
    guangzhou: [180, 160, 151, 106, 145, 150, 130, 120, 161, 134],
    hangzhou: [86, 184, 64, 165, 175, 133, 81, 60, 137, 115],
    shenzhen: [148, 137, 74, 113, 21, 18, 92, 55, 83, 90]
  },
  'Sixteen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Sixteen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Sixteen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Sixteen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Sixteen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Sixteen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Sixteen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Sixteen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Sixteen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Sixteen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Sixteen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Sixteen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Seventeen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Seventeen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Seventeen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Seventeen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Seventeen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Seventeen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Seventeen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Seventeen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Seventeen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Seventeen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Seventeen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Seventeen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Eighteen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Eighteen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Eighteen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Eighteen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Eighteen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Eighteen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Eighteen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Eighteen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Eighteen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Eighteen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Eighteen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Eighteen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Nineteen,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Nineteen,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Nineteen,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Nineteen,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Nineteen,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Nineteen,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Nineteen,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Nineteen,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Nineteen,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Nineteen,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Nineteen,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Nineteen,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Twenty,January': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Twenty,february': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Twenty,March': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Twenty,April': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Twenty,May': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Twenty,June': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
  'Twenty,July': {
    pieData: [{ value: 257, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 278, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 187, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Twenty,August': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 187, name: '华东地区' }, { value: 257, name: '中南地区' }, { value: 338, name: '西南地区' }, { value: 278, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Twenty,September': {
    pieData: [{ value: 187, name: '华北地区' }, { value: 257, name: '东北地区' }, { value: 338, name: '华东地区' }, { value: 278, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [69, 26, 155, 181, 148, 172, 59, 200, 161, 83],
    chengdu: [182, 142, 158, 131, 57, 189, 14, 132, 60, 117],
    shanghai: [183, 94, 74, 88, 73, 93, 36, 16, 87, 118],
    guangzhou: [182, 195, 141, 129, 198, 52, 10, 43, 66, 162],
    hangzhou: [45, 109, 116, 85, 21, 180, 155, 141, 12, 7],
    shenzhen: [169, 196, 188, 182, 41, 40, 44, 122, 158, 118]
  },
  'Twenty,October': {
    pieData: [{ value: 338, name: '华北地区' }, { value: 278, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 100, name: '中南地区' }, { value: 187, name: '西南地区' }, { value: 257, name: '西北地区' }],
    beijing: [99, 98, 52, 72, 33, 7, 84, 19, 36, 154],
    chengdu: [189, 173, 133, 53, 197, 90, 120, 47, 157, 168],
    shanghai: [182, 100, 127, 193, 185, 10, 186, 98, 190, 104],
    guangzhou: [173, 91, 182, 26, 104, 117, 36, 85, 192, 139],
    hangzhou: [89, 21, 133, 53, 46, 102, 141, 183, 90, 8],
    shenzhen: [130, 101, 192, 114, 125, 74, 18, 33, 128, 88]
  },
  'Twenty,November': {
    pieData: [{ value: 320, name: '华北地区' }, { value: 187, name: '东北地区' }, { value: 257, name: '华东地区' }, { value: 338, name: '中南地区' }, { value: 278, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [100, 164, 50, 31, 191, 144, 94, 187, 88, 188],
    chengdu: [12, 188, 1, 31, 30, 140, 164, 28, 149, 174],
    shanghai: [130, 41, 81, 68, 57, 123, 15, 98, 183, 122],
    guangzhou: [119, 28, 64, 110, 124, 51, 144, 8, 162, 27],
    hangzhou: [61, 93, 14, 22, 79, 103, 20, 54, 113, 11],
    shenzhen: [63, 8, 59, 115, 170, 120, 145, 106, 101, 164]
  },
  'Twenty,December': {
    pieData: [{ value: 278, name: '华北地区' }, { value: 240, name: '东北地区' }, { value: 149, name: '华东地区' }, { value: 187, name: '中南地区' }, { value: 180, name: '西南地区' }, { value: 120, name: '西北地区' }],
    beijing: [107, 37, 181, 61, 78, 93, 156, 129, 104, 140],
    chengdu: [16, 69, 24, 140, 46, 2, 39, 113, 169, 72],
    shanghai: [117, 52, 21, 118, 61, 12, 79, 136, 181, 68],
    guangzhou: [134, 186, 46, 127, 68, 133, 42, 2, 97, 76],
    hangzhou: [17, 131, 194, 152, 12, 19, 15, 94, 88, 6],
    shenzhen: [21, 53, 80, 79, 28, 94, 164, 187, 61, 112]
  },
}
export default {
  name: 'timeComparison',
  components: { 
    PanelGroup,
    PanelGroup2,
    LineChart,
    PieChart
  },
  data() {
    return {
      lineChartData: lineChartData.newVisitis,
      lineChartData2: lineChartData2.newVisitis
    }
  },
  methods: {
    handleSetLineChartData(type) {
      this.lineChartData = lineChartData[type]
    },
    handleSetLineChartData2(type) {
      this.lineChartData2 = lineChartData2[type]
    }
  }
}
</script>

<style lang="scss" scoped>
.timeComparison-container {
  padding: 32px;
  background-color: rgb(240, 242, 245);
  position: relative;
  .chart-wrapper {
    background: #fff;
    padding: 16px 16px 0;
    margin-bottom: 32px;
  }
}
@media (max-width:1024px) {
  .chart-wrapper {
    padding: 8px;
  }
}
</style>
